samdonnelly/STM32F4-driver-test/sources/device_test/sik_radio_test.cpp
/**
 * @file sik_radio_test.cpp
 * 
 * @author Sam Donnelly (samueldonnelly11@gmail.com)
 * 
 * @brief SiK radio driver test 
 * 
 * @details Setup 
 *          - Hardware 
 *            * STM32F4 microcontroller with a serial connection to a PC 
 *            * Two SiK telemetry radios (or RFD900): 
 *              1. One connected to the STM32F4 
 *              2. Another connected to a PC running Mission Planner 
 *          - Software 
 *            * Mission Planner on a PC with an established USB connection to one of the 
 *              telemetry radios and using the MAVLINK protocol. 
 *            * Serial monitor on a PC to allow the exchange of info with the STM32F4. 
 *          - Notes 
 *            * A single PC connected to the STM32F4 and running Mission Planner can be 
 *              used or it can be two separate computers. 
 *            * Certain communication (AT/RT) settings must match between both telemetry 
 *              radios in order for them to work together. See the SiK radio documentation 
 *              for more details. 
 *            * A connection between both radios must be established before any 
 *              meaningful work can be done by this code. 
 *          
 *          Configuration 
 *          - UART 
 *            * Two UART ports must be configured, one for the serial terminal connection 
 *              and another for the SiK radio. 
 *          - DMA 
 *            * Since data can be sent to the STM32F4 via UART from either the serial 
 *              terminal or the SiK radio without the STM32F4 requesting it, DMA is 
 *              configured for both UART ports so the data automatically gets stored 
 *              in a buffer. This prevents and loss of data. 
 *          - Interrupts 
 *            * Interrupts are configured for both UART ports for when an RX line is 
 *              detected to have gone idle. This indicates that there was data being 
 *              received and that the data is now done being received. The test code 
 *              won't perform any actions unless and interrupt occurs. 
 *          
 *          Dependencies 
 *          - STM32F4 driver library 
 *            - This library provides an easy interface to the SiK radio device driver 
 *              as well as UART, DMA and interrupt drivers. 
 *          - MAVLINK V2 C library 
 *            - The SiK radios and Mission Planner are designed to work with the MAVLINK 
 *              protocol. This code uses the library to decode and encode MAVLINK 
 *              messages. 
 *            - There are pre-built C and Python libraries but specific library versions 
 *              can be built manually. The pre-built C library works for this 
 *              application. 
 *          
 *          Procedure 
 *          - This code looks for data received via UART from both the SiK telemetry 
 *            radio and the serial terminal. When data is input from either source, 
 *            DMA will transfer the data to a circular buffer and an interrupt will be 
 *            triggered once there is no more data to transfer. This interrupt causes 
 *            the code to parse the circular buffer data into the complete input which 
 *            is then used to carry out various commands. In addition to these inputs, 
 *            there is also a periodic timer interrupt which carries out actions at 
 *            fixed intervals. 
 *          
 *          - There are two primary modes for this test: MAVLink mode and AT command 
 *            mode. 
 *            * MAVLink mode (default) uses the SiK radio as a serial bridge to send and 
 *              receive MAVLink messages with an external telemtry radio. Note that the 
 *              radio can be configured to not use MAVLink packet framing but that is 
 *              not supported in this test. In this mode, the device will attempt to 
 *              decode inputs into MAVLink messages & payloads and it will also send 
 *              MAVLink messages both periodically and at the request of the user. There 
 *              is a sub-mode within MAVLink mode which is user input mode. By default 
 *              user input mode is disabled and in this state the IDs of any received
 *              MAVLink message will be output to the serial terminal for the user to 
 *              see. User input mode can be entered from MAVLink mode by inputting 
 *              anything into the serial terminal (i.e. inputting some formatted command 
 *              will have no other affect). Once in user input mode, message IDs will 
 *              stop being displayed and instead a prompt will be shown where the user 
 *              can input other commands. You must be in user input mode to send commands 
 *              to the radio. From user input mode you can transition to AT command mode. 
 *            * AT command mode is used to configure the settings of the SiK radio. To 
 *              enter this mode, you must input the appropriate command from MAVLink 
 *              user input mode. In this mode, commands input by the user will be relayed 
 *              to the radio and any responses from the radio will be echoed to the 
 *              serial terminal for the user to see. This code provides the interface to 
 *              configure the radio but for info on how to properly configure the radio 
 *              the device documentation should be used. You can exit this mode using the 
 *              appropriate command at the prompt and you will be taken back to user 
 *              input mode in MAVLink mode. 
 *          
 *          - When attempting to transition from MAVLink user input mode to AT command 
 *            mode, the code will enter a temporary "request" mode. The request will be 
 *            sent to the radio to enter AT command mode and the code will wait on the 
 *            response from the radio indicating that AT command mode has been entered. 
 *            In the meantime no other actions can be requested by the user (it typically 
 *            takes ~1s for the radio to enter AT mode). If the confirmation is not seen 
 *            from the radio after a certain amount of time then the request will time 
 *            out and the user will remain in MAVLink user input mode. 
 *          
 *          - For a list of commands available to the user, see the list of pre-defined 
 *            strings below under the "Commands" section. 
 * 
 * @version 0.1
 * @date 2024-12-11
 * 
 * @copyright Copyright (c) 2024
 * 
 */

//=======================================================================================
// Includes 

