samdonnelly/STM32F4-driver-test/sources/device_test/sik_radio_test.cpp
#include "sik_radio_test.h" 
#include "stm32f4xx_it.h" 

extern "C"
{
    // For C headers without C++ guards 
    #include "common/mavlink.h" 
}

//=======================================================================================


//=======================================================================================
// Macros 

#define SIK_TEST_MSG_BUFF_SIZE 1000 
#define SIK_TEST_SYS_ID 1            // GCS IDs start at 255, systems start at 1 

// Periodic timing data 
// - ARR = Auto Reload Register - number of counts before periodic timer resets. 
// - SIK_TEST_PRESCALAR must coordinate with the timer_us_prescalars_t type used in the 
//   periodic timer init. 
// - SIK_TEST_INT_PERIOD is the period in ms of the periodic interrupt. This is used 
//   to find the timer count limit when the GCS requests a certain message rate. 
#define SIK_TEST_ARR 2500 
#define SIK_TEST_PRESCALAR 10000 
#define SIK_TEST_INT_PERIOD SIK_TEST_ARR * S_TO_MS / SIK_TEST_PRESCALAR 

#define SIK_TEST_HB_FREQ 1       // Heartbeat message send frequency 
#define SIK_TEST_HB_TIMEOUT 40   // Heartbeat message timeout - adjust with interrupt period 
#define SIK_TEST_AT_TIMEOUT 20   // AT mode timeout - adjust with interrupt period 

// Mock data 
#define SIK_TEST_MOCK_BOOT_TIME 100 
#define SIK_TEST_MOCK_LAT 506132700 
#define SIK_TEST_MOCK_LON -1151237700 
#define SIK_TEST_MOCK_ALTITUDE 1 
#define SIK_TEST_MOCK_NUM_SATELLITES 4 

//=======================================================================================


//=======================================================================================
// Global data 

// User & device serial interface data 
struct sik_serial_data_t 
{
    USART_TypeDef *uart; 
    DMA_Stream_TypeDef *dma_stream; 
    uint8_t cb[SIK_TEST_MSG_BUFF_SIZE];              // Circular buffer populated by DMA 
    cb_index_t cb_index;                             // Circular buffer indexing info 
    dma_index_t dma_index;                           // DMA transfer indexing info 
    uint8_t data_in_buff[SIK_TEST_MSG_BUFF_SIZE];    // Buffer that stores latest UART input 
    uint8_t data_out_buff[SIK_TEST_MSG_BUFF_SIZE];   // Buffer that stores outgoing data 
    uint16_t data_in_index;                          // Data input buffer index 
}; 

static sik_serial_data_t radio_data; 
static sik_serial_data_t user_data; 


// MAVLink message send timing info 
struct sik_msg_timing_t
{
    uint8_t count; 
    uint8_t count_lim; 
    uint8_t enable : 1; 
}; 


// MAVLink messages 
struct sik_mavlink_msgs_t 
{
    // Incoming messages 
    mavlink_heartbeat_t heartbeat_msg_gcs; 
    mavlink_param_request_list_t param_request_list_msg; 
    mavlink_mission_request_t mission_request_msg; 
    mavlink_request_data_stream_t request_data_stream_msg; 
    mavlink_command_long_t command_long_msg; 
    
    // Outgoing messages 
    mavlink_heartbeat_t heartbeat_msg; 
    mavlink_raw_imu_t raw_imu_msg; 
    mavlink_gps_raw_int_t gps_raw_int_msg; 
    mavlink_rc_channels_scaled_t rc_channels_scaled_msg; 
    mavlink_rc_channels_raw_t rc_channels_raw_msg; 
    mavlink_servo_output_raw_t servo_output_raw_msg; 
    mavlink_attitude_t attitude_msg; 
    mavlink_position_target_global_int_t position_target_global_int_msg; 
    mavlink_nav_controller_output_t nav_controller_output_msg; 
    mavlink_local_position_ned_t local_position_ned_msg; 
    mavlink_global_position_int_t global_pos_int_msg; 
    mavlink_mission_item_int_t mission_item_int_msg; 

    // Message send (outgoing) timing info 
    sik_msg_timing_t heartbeat_msg_timing;                    // HEARTBEAT 
    sik_msg_timing_t raw_imu_msg_timing;                      // RAW_IMU 
    sik_msg_timing_t gps_raw_int_msg_timing;                  // GPS_RAW_INT 
    sik_msg_timing_t rc_channels_scaled_msg_timing;           // RC_CHANNELS_SCALED 
    sik_msg_timing_t rc_channels_raw_msg_timing;              // RC_CHANNELS_RAW 
    sik_msg_timing_t servo_output_raw_msg_timing;             // SERVO_OUTPUT_RAW 
    sik_msg_timing_t attitude_msg_timing;                     // ATTITUDE 
    sik_msg_timing_t position_target_global_int_msg_timing;   // POSITION_TARGET_GLOBAL_INT 
    sik_msg_timing_t nav_controller_output_msg_timing;        // NAV_CONTROLLER_OUTPUT 
    sik_msg_timing_t local_position_ned_msg_timing;           // LOCAL_POSITION_NED 
    sik_msg_timing_t global_pos_int_msg_timing;               // GLOBAL_POSITION_INT 
}; 


// System data 
class SikSystemData : public sik_mavlink_msgs_t 
{
public: 
    // MAVLink identification 
    int channel; 
    uint8_t system_id; 
    uint8_t component_id; 

    // MAVLink packet handling 
    mavlink_message_t msg; 
    mavlink_status_t status; 

    // Status timers 
    uint8_t heartbeat_status_timer; 
    uint8_t at_mode_request_timer; 

    // Status flags 
    uint8_t at_mode           : 1;   // AT command mode 
    uint8_t at_mode_requested : 1;   // AT command mode requested 
    uint8_t ui_mode           : 1;   // User input mode 
    uint8_t connected         : 1;   // Radio connected 
}; 

static SikSystemData system_data; 


const char 
// Formatting 
sik_test_user_prompt[] = "\r\n>>> ", 
sik_test_overwrite[] = "\r", 
// Feedback 
sik_test_user_msgid[] = "msgid: %lu\r\n", 
// Commands 
sik_test_user_exitui[] = "exitui", 
// Status 
sik_test_at_request[] = "Requesting AT command mode... ", 
sik_test_at_confirm[] = "OK\r\n", 
sik_test_timeout_msg[] = "timeout\r\n"; 

//=======================================================================================


//=======================================================================================
// Prototypes 

// Data initialization 
void sik_radio_test_init_data(void); 

/**
 * @brief AT command mode radio input decode 
 * 
 * @details Used to decode radio input when in AT command mode. This function doesn't so 
 *          much decode as it does echo the radio input to the serial terminal for the 
 *          user to see. It's labelled as a decoding function to better align with the 
 *          other input mode functions. 
 *          
 *          When a user inputs a valid AT command while in AT command mode, the radio 
 *          should respond with the requested info. Echoing this input helps the user 
 *          configure the radio as needed. 
 */
void sik_radio_test_at_radio_decode(void); 


/**
 * @brief MAVLink mode radio input decode 
 * 
 * @details Used to decode radio input while in MAVLink mode. This function is primarily 
 *          used to decode MAVLink messages received by the radio, however if in MAVLink 
 *          mode and the user requests to go to AT command mode, this function will check 
 *          if the radio responds with an acknowledgement that it has entere AT mode. 
 */
void sik_radio_test_mavlink_radio_decode(void); 


/**
 * @brief AT command mode user input decode 
 * 
 * @details Used to decode user input when in AT command mode. Some decoding is done to 
 *          check for specific user commands but if no match is found then the user input 
 *          is forwarded to the radio. This gives the user easy control over configuring 
 *          the radio. 
 */
void sik_radio_test_at_user_decode(void); 


/**
 * @brief MAVLink mode user input decode 
 * 
 * @details Used to decode user input when in MAVLink mode. A match to specific 
 *          predefined commands is checked for. If no match is found then nothing happens.
 *          When the system is in MAVLink mode and not in user input mode then any input 
 *          will trigger user input mode and nothing else. 
 */
void sik_radio_test_mavlink_user_decode(void); 


/**
 * @brief MAVLink message payload decode 
 * 
 * @details Decodes the payload of a received MAVLink message once the received radio 
 *          data is decoded into a complete MAVLink message. A function like this is 
 *          recommended by the MAVLink documentation for identifying and handling 
 *          messages. Different messages can be added as needed. 
 */
void sik_radio_test_mavlink_payload_decode(void); 

// MAVLink received message actions 
void sik_radio_test_mavlink_request_data_stream(void); 
void sik_radio_test_mavlink_param_request_list(void); 
void sik_radio_test_mavlink_mission_request(void); 
void sik_radio_test_mavlink_heartbeat(void); 
void sik_radio_test_mavlink_command_long(void); 


/**
 * @brief MAVlink mode periodic actions 
 * 
 * @details This function performs periodic actions when in MAVLink mode. 
 */
void sik_radio_test_mavlink_periodic(void); 

