samdonnelly/STM32F4-driver-test/sources/device_test/sik_radio_test.cpp
        case MAVLINK_MSG_ID_MISSION_REQUEST: 
            sik_radio_test_mavlink_mission_request(); 
            break; 

        case MAVLINK_MSG_ID_REQUEST_DATA_STREAM: 
            sik_radio_test_mavlink_request_data_stream(); 
            break; 
        
        case MAVLINK_MSG_ID_COMMAND_LONG: 
            // Call a separate function to decode mavlink_command_long_t.command 
            sik_radio_test_mavlink_command_long(); 
            break; 
        
        default: 
            break; 
    }
}


// MAVLink HEARTBEAT message actions 
void sik_radio_test_mavlink_heartbeat(void)
{
    mavlink_msg_heartbeat_decode(
        &system_data.msg, 
        &system_data.heartbeat_msg_gcs); 
    system_data.heartbeat_status_timer = CLEAR; 
    system_data.connected = SET_BIT; 
}


// MAVLink PARAM_REQUEST_LIST message actions 
void sik_radio_test_mavlink_param_request_list(void)
{
    mavlink_msg_param_request_list_decode(
        &system_data.msg, 
        &system_data.param_request_list_msg); 
}


// MAVLink MISSION_REQUEST message actions 
void sik_radio_test_mavlink_mission_request(void)
{
    mavlink_msg_mission_request_decode(
        &system_data.msg, 
        &system_data.mission_request_msg); 

    snprintf((char *)user_data.data_out_buff, 
        SIK_TEST_MSG_BUFF_SIZE, 
        "system: %u, component: %u, seq: %u, mission_type: %u\r\n", 
        system_data.mission_request_msg.target_system, 
        system_data.mission_request_msg.target_component, 
        system_data.mission_request_msg.seq, 
        system_data.mission_request_msg.mission_type); 
    sik_radio_test_user_output((char *)user_data.data_out_buff); 
}


// MAVLink REQUEST_DATA_STREAM message actions 
void sik_radio_test_mavlink_request_data_stream(void)
{
    // Mission Planner sends this message to request data from the autopilot. 
    // When attempting to connect, this message will be sent in rapid succession. 

    mavlink_msg_request_data_stream_decode(
        &system_data.msg, 
        &system_data.request_data_stream_msg); 

    // This message comes with a cooresponding requested message rate. The calculated 
    // timer counter limit is the same calculation for each requested message so it's 
    // done once here and assigned to the requested message. Note that the periodic 
    // interrupt period should be equipped to handle whatever the requested rate is. 
    uint8_t timer_limit = (uint8_t)(S_TO_MS / 
        (system_data.request_data_stream_msg.req_message_rate * SIK_TEST_INT_PERIOD)); 
    uint8_t enable = system_data.request_data_stream_msg.start_stop; 

    // Enable/disable the requested message and assign the message timer counter limit 
    // so it gets sent to the GCS at the requested rate. 
    switch (system_data.request_data_stream_msg.req_stream_id)
    {
        case MAV_DATA_STREAM_ALL: 
            break; 
        
        case MAV_DATA_STREAM_RAW_SENSORS: 
            system_data.raw_imu_msg_timing.enable = enable; 
            system_data.raw_imu_msg_timing.count_lim = timer_limit; 
            system_data.gps_raw_int_msg_timing.enable = enable; 
            system_data.gps_raw_int_msg_timing.count_lim = timer_limit; 
            break; 

        case MAV_DATA_STREAM_EXTENDED_STATUS: 
            break; 

        case MAV_DATA_STREAM_RC_CHANNELS: 
            system_data.rc_channels_scaled_msg_timing.enable = enable; 
            system_data.rc_channels_scaled_msg_timing.count_lim = timer_limit; 
            system_data.rc_channels_raw_msg_timing.enable = enable; 
            system_data.rc_channels_raw_msg_timing.count_lim = timer_limit; 
            system_data.servo_output_raw_msg_timing.enable = enable; 
            system_data.servo_output_raw_msg_timing.count_lim = timer_limit; 
            break; 

        case MAV_DATA_STREAM_RAW_CONTROLLER: 
            system_data.attitude_msg_timing.enable = enable; 
            system_data.attitude_msg_timing.count_lim = timer_limit; 
            system_data.position_target_global_int_msg_timing.enable = enable; 
            system_data.position_target_global_int_msg_timing.count_lim = timer_limit; 
            system_data.nav_controller_output_msg_timing.enable = enable; 
            system_data.nav_controller_output_msg_timing.count_lim = timer_limit; 
            break; 

        case MAV_DATA_STREAM_POSITION: 
            system_data.local_position_ned_msg_timing.enable = enable; 
            system_data.local_position_ned_msg_timing.count_lim = timer_limit; 
            system_data.global_pos_int_msg_timing.enable = enable; 
            system_data.global_pos_int_msg_timing.count_lim = timer_limit; 
            break; 

        case MAV_DATA_STREAM_EXTRA1: 
            break; 

        case MAV_DATA_STREAM_EXTRA2: 
            break; 

        case MAV_DATA_STREAM_EXTRA3: 
            break; 

        default: 
            break; 
    }

    // snprintf((char *)user_data.data_out_buff, 
    //     SIK_TEST_MSG_BUFF_SIZE, 
    //     "system: %u, component: %u, stream: %u, rate: %u, start/stop: %u\r\n", 
    //     system_data.request_data_stream_msg.target_system, 
    //     system_data.request_data_stream_msg.target_component, 
    //     system_data.request_data_stream_msg.req_stream_id, 
    //     system_data.request_data_stream_msg.req_message_rate, 
    //     system_data.request_data_stream_msg.start_stop); 
    // sik_radio_test_user_output((char *)user_data.data_out_buff); 
}


// MAVLink COMMAND_LONG message actions 
void sik_radio_test_mavlink_command_long(void)
{
    mavlink_msg_command_long_decode(
        &system_data.msg, 
        &system_data.command_long_msg); 
}

//=======================================================================================


//=======================================================================================
// Periodic actions 

// MAVlink mode periodic actions 
void sik_radio_test_mavlink_periodic(void)
{
    // Everything here is performed periodically when in MAVLink mode. 
    sik_radio_test_mavlink_periodic_timeout(); 
    sik_radio_test_mavlink_periodic_send(); 
}


// MAVLink periodic timeout check 
void sik_radio_test_mavlink_periodic_timeout(void)
{
    // Check for a connection (heartbeat) timeout 
    if (system_data.heartbeat_status_timer++ >= SIK_TEST_HB_TIMEOUT)
    {
        // Have not seen a heartbeat message from a GCS for too long. The system is 
        // considered to be disconnected. 
        system_data.heartbeat_status_timer--; 
        system_data.connected = CLEAR_BIT; 
    }

    // Check for an AT command mode request timeout 
    if (system_data.at_mode_requested)
    {
        // If AT command mode is being requested then the code waits on the appropriate 
        // response from the radio. Waiting for this response blocks other actions so 
        // once the system has waited too long then cancel the search and return to 
        // normal MAVLink mode. 
        if (system_data.at_mode_request_timer++ >= SIK_TEST_AT_TIMEOUT)
        {
            sik_radio_test_at_request_reset(sik_test_timeout_msg); 
            sik_at_mode(SIK_AT_EXIT); 
        }
    }
}


// MAVLink message periodic send 
void sik_radio_test_mavlink_periodic_send(void)
{
    // Check if any of the enabled periodic messages must be sent 

    // HEARTBEAT 
    if (system_data.heartbeat_msg_timing.enable && 
       (++system_data.heartbeat_msg_timing.count >= 
          system_data.heartbeat_msg_timing.count_lim))
    {
        system_data.heartbeat_msg_timing.count = CLEAR; 
        mavlink_msg_heartbeat_encode_chan(
            system_data.system_id, 
            system_data.component_id, 
            system_data.channel, 
            &system_data.msg, 
            &system_data.heartbeat_msg); 
        sik_radio_test_mavlink_send_msg(); 
    }

    // RAW_IMU 
    if (system_data.raw_imu_msg_timing.enable && 
       (++system_data.raw_imu_msg_timing.count >= 
          system_data.raw_imu_msg_timing.count_lim))
    {
        system_data.raw_imu_msg_timing.count = CLEAR; 
        mavlink_msg_raw_imu_encode_chan(
            system_data.system_id, 
            system_data.component_id, 
            system_data.channel, 
            &system_data.msg, 
            &system_data.raw_imu_msg); 
        sik_radio_test_mavlink_send_msg(); 
    }

    // GPS_RAW_INT 
    if (system_data.gps_raw_int_msg_timing.enable && 
       (++system_data.gps_raw_int_msg_timing.count >= 
          system_data.gps_raw_int_msg_timing.count_lim))
    {
        system_data.gps_raw_int_msg_timing.count = CLEAR; 
        mavlink_msg_gps_raw_int_encode_chan(
            system_data.system_id, 
            system_data.component_id, 
            system_data.channel, 
            &system_data.msg, 
            &system_data.gps_raw_int_msg); 
        sik_radio_test_mavlink_send_msg(); 
    }

    // RC_CHANNELS_SCALED 
    if (system_data.rc_channels_scaled_msg_timing.enable && 
       (++system_data.rc_channels_scaled_msg_timing.count >= 
          system_data.rc_channels_scaled_msg_timing.count_lim))
    {
        system_data.rc_channels_scaled_msg_timing.count = CLEAR; 
        mavlink_msg_rc_channels_scaled_encode_chan(
            system_data.system_id, 
            system_data.component_id, 
            system_data.channel, 
            &system_data.msg, 
            &system_data.rc_channels_scaled_msg); 
        sik_radio_test_mavlink_send_msg(); 
    }

    // RC_CHANNELS_RAW 
    if (system_data.rc_channels_raw_msg_timing.enable && 
       (++system_data.rc_channels_raw_msg_timing.count >= 
          system_data.rc_channels_raw_msg_timing.count_lim))
    {
        system_data.rc_channels_raw_msg_timing.count = CLEAR; 
        mavlink_msg_rc_channels_raw_encode_chan(
            system_data.system_id, 
            system_data.component_id, 
            system_data.channel, 
            &system_data.msg, 
            &system_data.rc_channels_raw_msg); 
        sik_radio_test_mavlink_send_msg(); 
    }

    // SERVO_OUTPUT_RAW 
    if (system_data.servo_output_raw_msg_timing.enable && 
       (++system_data.servo_output_raw_msg_timing.count >= 
          system_data.servo_output_raw_msg_timing.count_lim))
    {
        system_data.servo_output_raw_msg_timing.count = CLEAR; 
        mavlink_msg_servo_output_raw_encode_chan(
            system_data.system_id, 
            system_data.component_id, 
            system_data.channel, 
            &system_data.msg, 
            &system_data.servo_output_raw_msg); 
        sik_radio_test_mavlink_send_msg(); 
    }

    // ATTITUDE 
    if (system_data.attitude_msg_timing.enable && 
       (++system_data.attitude_msg_timing.count >= 
          system_data.attitude_msg_timing.count_lim))
    {
        system_data.attitude_msg_timing.count = CLEAR; 
        mavlink_msg_attitude_encode_chan(
            system_data.system_id, 
            system_data.component_id, 
            system_data.channel, 
            &system_data.msg, 
            &system_data.attitude_msg); 
        sik_radio_test_mavlink_send_msg(); 
    }

    // POSITION_TARGET_GLOBAL_INT 
    if (system_data.position_target_global_int_msg_timing.enable && 
       (++system_data.position_target_global_int_msg_timing.count >= 
          system_data.position_target_global_int_msg_timing.count_lim))
    {
        system_data.position_target_global_int_msg_timing.count = CLEAR; 
        mavlink_msg_position_target_global_int_encode_chan(
            system_data.system_id, 
            system_data.component_id, 
            system_data.channel, 
            &system_data.msg, 
            &system_data.position_target_global_int_msg); 
        sik_radio_test_mavlink_send_msg(); 
    }

    // NAV_CONTROLLER 
    if (system_data.nav_controller_output_msg_timing.enable && 
       (++system_data.nav_controller_output_msg_timing.count >= 
          system_data.nav_controller_output_msg_timing.count_lim))
    {
        system_data.nav_controller_output_msg_timing.count = CLEAR; 
        mavlink_msg_nav_controller_output_encode_chan(
            system_data.system_id, 
            system_data.component_id, 
            system_data.channel, 
            &system_data.msg, 
            &system_data.nav_controller_output_msg); 
        sik_radio_test_mavlink_send_msg(); 
    }

    // LOCAL_POSITION_NED 
    if (system_data.local_position_ned_msg_timing.enable && 
       (++system_data.local_position_ned_msg_timing.count >= 
          system_data.local_position_ned_msg_timing.count_lim))
    {
        system_data.local_position_ned_msg_timing.count = CLEAR; 
        mavlink_msg_local_position_ned_encode_chan(
            system_data.system_id, 
            system_data.component_id, 
            system_data.channel, 
            &system_data.msg, 
            &system_data.local_position_ned_msg); 
        sik_radio_test_mavlink_send_msg(); 
    }

    // GLOBAL_POSITION_INT 
    if (system_data.global_pos_int_msg_timing.enable && 
       (++system_data.global_pos_int_msg_timing.count >= 
          system_data.global_pos_int_msg_timing.count_lim))
    {
        system_data.global_pos_int_msg_timing.count = CLEAR; 
        mavlink_msg_global_position_int_encode_chan(
            system_data.system_id, 
            system_data.component_id, 
            system_data.channel, 
            &system_data.msg, 
            &system_data.global_pos_int_msg); 
        sik_radio_test_mavlink_send_msg(); 
    }
}

//=======================================================================================


//=======================================================================================
// Helper functions 

// User prompt 
void sik_radio_test_user_output(const char *user_msg)
{
    uart_send_str(user_data.uart, user_msg); 
}


// AT command mode request reset 
void sik_radio_test_at_request_reset(const char *user_msg)
{
    system_data.at_mode_request_timer = CLEAR; 
    system_data.at_mode_requested = CLEAR_BIT; 
    sik_radio_test_user_output(user_msg); 
    sik_radio_test_user_output(sik_test_user_prompt); 
}


// Serialize and send MAVLink message 
void sik_radio_test_mavlink_send_msg(void)
{
    sik_send_data(radio_data.data_out_buff, 
                  mavlink_msg_to_send_buffer(radio_data.data_out_buff, &system_data.msg)); 
}

//=======================================================================================
